? func_8004EBEC(u8);                                /* extern */
s32 func_8004EC14();                                /* extern */
? func_800563F0(?, ?);                              /* extern */
extern s8 D_800B3D00;
extern s8 D_800E62BA;

void func_80142A80(void) {
    u8 sp43;
    s32 sp3C;
    u8 sp34;

    D_800E62BA = 0x80;
    sp43 = func_8004ADD4();
    func_8004ADAC(0);
    func_80048DD0(0);
    func_8006C760(1);
    func_8006BD6C(0);
    func_800438F0(1);
    func_8004E58C();
    sp3C = func_8004EC14();
    func_8004EBEC(3U);
    func_8004E788(-0x88, 0x5C, 8, (s32) "　　　　　", 0);
    func_8004E788(-0x88, 0x5C, 8, (s32) "好きとか　嫌いとか", 0);
    func_8004E788(-0x88, 0x5C, 8, (s32) "最初に言い出したのは　誰なのかしら", 0);
    func_8004E788(-0x88, 0x5C, 8, (s32) "駆け抜けてゆく　私のメモリアル", 0);
    func_8004E788(-0x88, 0x5C, 8, (s32) "今日も鏡のまえで　髪をとかして　", 0);
    func_8004E788(-0x88, 0x5C, 8, (s32) "ピンクのリップは　Ｓｗｅｅｔ　Ｍａｇｉｃ", 0);
    func_8004E788(-0x88, 0x5C, 8, (s32) "とっておきのコロン", 0);
    func_8004E788(-0x88, 0x5C, 8, (s32) "さ・さ・や・き　キ・ラ・メ・キ", 0);
    func_8004E788(-0x88, 0x5C, 8, (s32) "ド・キ・ド・キ　大好き", 0);
    func_8004E788(-0x88, 0x5C, 8, (s32) "あなただけに見つめてほしい", 0);
    func_8004E788(-0x88, 0x5C, 8, (s32) "Ｔａｋｅ　ｔｈｅ　Ｃｈａｎｃｅ", 0);
    func_8004E788(-0x88, 0x5C, 8, (s32) "仕上げは上出来", 0);
    func_8004E788(-0x88, 0x5C, 8, (s32) "Ｔｅｌｌ　Ｙｏｕｒ　Ｈｅａｒｔ", 0);
    func_8004E788(-0x88, 0x5C, 8, (s32) "準備はＯＫ", 0);
    func_8004E788(-0x88, 0x5C, 8, (s32) "素敵な\x97\\感　そよ風に乗せ", 0);
    func_8004E788(-0x88, 0x5C, 8, (s32) "Ｔｒｙ　Ｙｏｕｒ　ＬＵＣＫ", 0);
    func_8004E788(-0x88, 0x5C, 8, (s32) "制服のリボン", 0);
    func_8004E788(-0x88, 0x5C, 8, (s32) "Ｔｅｌｌ　Ｙｏｕｒ　Ｌｏｖｅ", 0);
    func_8004E788(-0x88, 0x5C, 8, (s32) "結び直したら", 0);
    func_8004E788(-0x88, 0x5C, 8, (s32) "今日こそ言えそう", 0);
    func_8004E788(-0x88, 0x5C, 8, (s32) "Ｌｏｖｅ　ｍｅ　ｐｌｅａｓｅ‥‥‥", 0);
    func_8004E884(0);
    func_800563F0(0x18, 0x10);
    func_80056BA8(0, 0x33B, 0x820);
    func_80088070();
    sp34 = 0x80;
    func_80045414(0xE, 0, &sp34);
    func_80045414(9, 0, NULL);
    func_80045414(0xA, 0, NULL);
    func_80053650(0x80167000, 0x80162000, 0x80162000);
    func_8009C210(1);
    func_80041168(0);
    func_8009C674(0);
    func_80048DD0(0);
    main_state_set(0x12);
    func_8004ADAC((s32) sp43);
    func_8004EBEC((u8) sp3C);
    func_8006C760(0);
    func_8006BC28(0);
    func_8006BD6C(0);
    D_800B3CF8 = 0;
    D_800B3CFC = 0;
    D_800B3D00 = 0;
}
